<template>
  <div class="policy">
    <h1>プライバシーポリシー</h1>
    <p>
      Twin:teは，本ウェブサイト上で提供するサービス（以下,「本サービス」といいます。）における，ユーザーの個人情報の取扱いについて，以下のとおりプライバシーポリシー（以下，「本ポリシー」といいます。）を定めます。
    </p>
    <section>
      <h2>第1条（個人情報）</h2>
      <p>
        「個人情報」とは，個人情報保護法にいう「個人情報」を指すものとし，生存する個人に関する情報であって，当該情報に含まれる氏名，生年月日，住所，電話番号，連絡先その他の記述等により特定の個人を識別できる情報及び容貌，指紋，声紋にかかるデータ，及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。
      </p>
    </section>
    <section>
      <h2>第2条（個人情報の収集方法）</h2>
      <p>
        Twin:teは，ユーザーが利用登録をする際に利用するサービス（Twitter,Google等）から提供されるOAuthトークンを保存します。
        それと共に入力されたメモ情報や出席・欠席・遅刻回数等の情報も保存します。学籍番号やID,パスワード等の個人を特定できる物は一切保存しません。
      </p>
    </section>
    <section>
      <h2>第3条（個人情報を収集・利用する目的）</h2>
      <p>Twin:teが個人情報を収集・利用する目的は，以下のとおりです。</p>
      <ol>
        <li>Twin:teサービスの提供・運営のため</li>
      </ol>
    </section>
    <section>
      <h2>第4条（利用目的の変更）</h2>
      <ol>
        <li>
          Twin:teは，次に掲げる場合を除いて，あらかじめユーザーの同意を得ることなく，第三者に個人情報を提供することはありません。ただし，個人情報保護法その他の法令で認められる場合を除きます。
          <ol>
            <li>
              人の生命，身体または財産の保護のために必要がある場合であって，本人の同意を得ることが困難であるとき
            </li>
            <li>
              公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって，本人の同意を得ることが困難であるとき
            </li>
            <li>
              国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって，本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
            </li>
            <li>
              予め次の事項を告知あるいは公表し，かつTwin:teが個人情報保護委員会に届出をしたとき
              <ol>
                <li>利用目的に第三者への提供を含むこと</li>
                <li>利用目的に第三者への提供を含むこと</li>
                <li>第三者に提供されるデータの項目</li>
                <li>第三者への提供の手段または方法</li>
                <li>
                  本人の求めに応じて個人情報の第三者への提供を停止すること
                </li>
                <li>本人の求めを受け付ける方法</li>
              </ol>
            </li>
          </ol>
        </li>
        <li>
          前項の定めにかかわらず，次に掲げる場合には，当該情報の提供先は第三者に該当しないものとします。
          <ol>
            <li>
              Twin:teが利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
            </li>
            <li>
              合併その他の事由による事業の承継に伴って個人情報が提供される場合
            </li>
            <li>
              個人情報を特定の者との間で共同して利用する場合であって，その旨並びに共同して利用される個人情報の項目，共同して利用する者の範囲，利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について，あらかじめ本人に通知し，または本人が容易に知り得る状態に置いた場合
            </li>
          </ol>
        </li>
      </ol>
    </section>

    <section>
      <h2>第6条（個人情報の開示）</h2>
      <ol>
        <li>
          Twin:teは，本人から個人情報の開示を求められたときは，本人に対し，遅滞なくこれを開示します。ただし，開示することにより次のいずれかに該当する場合は，その全部または一部を開示しないこともあり，開示しない決定をした場合には，その旨を遅滞なく通知します。
          <ol>
            <li>
              本人または第三者の生命，身体，財産その他の権利利益を害するおそれがある場合
            </li>
            <li>
              Twin:teの業務の適正な実施に著しい支障を及ぼすおそれがある場合
            </li>
            <li>その他法令に違反することとなる場合</li>
          </ol>
        </li>
        <li>
          前項の定めにかかわらず，履歴情報および特性情報などの個人情報以外の情報については，原則として開示いたしません。
        </li>
      </ol>
    </section>

    <section>
      <h2>第7条（個人情報の訂正および削除）</h2>
      <ol>
        <li>
          ユーザーは，Twin:teの保有する自己の個人情報が誤った情報である場合には，Twin:teが定める手続きにより，Twin:teに対して個人情報の訂正，追加または削除（以下，「訂正等」といいます。）を請求することができます。
        </li>
        <li>
          Twin:teは，ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には，遅滞なく，当該個人情報の訂正等を行うものとします。
        </li>
        <li>
          Twin:teは，前項の規定に基づき訂正等を行った場合，または訂正等を行わない旨の決定をしたときは遅滞なく，これをユーザーに通知します。
        </li>
      </ol>
    </section>
    <section>
      <h2>第8条（個人情報の利用停止等）</h2>
      <ol>
        <li>
          Twin:teは，本人から，個人情報が，利用目的の範囲を超えて取り扱われているという理由，または不正の手段により取得されたものであるという理由により，その利用の停止または消去（以下，「利用停止等」といいます。）を求められた場合には，遅滞なく必要な調査を行います。
        </li>
        <li>
          前項の調査結果に基づき，その請求に応じる必要があると判断した場合には，遅滞なく，当該個人情報の利用停止等を行います。
        </li>
        <li>
          Twin:teは，前項の規定に基づき利用停止等を行った場合，または利用停止等を行わない旨の決定をしたときは，遅滞なく，これをユーザーに通知します。
        </li>
        <li>
          前2項にかかわらず，利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって，ユーザーの権利利益を保護するために必要なこれに代わるべき措置をとれる場合は，この代替策を講じるものとします。
        </li>
      </ol>
    </section>
    <section>
      <h2>第9条（プライバシーポリシーの変更）</h2>
      <ol>
        <li>
          本ポリシーの内容は，法令その他本ポリシーに別段の定めのある事項を除いて，ユーザーに通知することなく，変更することができるものとします。
        </li>
        <li>
          Twin:teが別途定める場合を除いて，変更後のプライバシーポリシーは，本ウェブサイトに掲載したときから効力を生じるものとします。
        </li>
      </ol>
    </section>
    <section>
      <h2>第10条（お問い合わせ窓口）</h2>
      <p>本ポリシーに関するお問い合わせは，下記の窓口までお願いいたします。</p>
      <ul>
        <li>Eメールアドレス：info@twinte.net</li>
      </ul>
      <p>以上</p>
      <a href="../">Twin:te公式サイトへもどる </a>
    </section>
  </div>
</template>

<style lang="scss" scoped>
@import '~/scss/main.scss';
.policy {
  padding: 3rem;
}
h1 {
  font-size: 1.8rem;
  font-weight: 500;
  line-height: 160%;
  @include text-liner;
  margin-bottom: 2rem;
}
h2 {
  line-height: 160%;
  font-weight: 500;
  font-size: 1.6rem;
}
ol {
  list-style: inside;
  list-style-type: decimal;
}
ol,
p {
  margin: 0;
  @include text-discription;
}
li {
  padding-left: 1.4rem;
}
section {
  margin-bottom: 2rem;
}
a {
  display: inline-block;
  margin-top: 2rem;
}
</style>
